//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//######################################################################

let mylist:number [];
let i ;
mylist=[];
for(i=0 ; i<5 ; i++) {
  mylist[i]=parseInt(prompt("اادخال الرقم"));
}
for(i=0 ;i<mylist.length ;i++){console.log("mylist ["+i + "] =" + mylist[i]);}
console.log(mylist);